Config/DataProcessors/WriteOffExpiredBonuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>WriteOffExpiredBonuses</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DiscountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BonusOperationSources</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Schedule</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/AccumulationRegisters/Bonuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Bonuses</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Card</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ExpiryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Enums/BonusesOperationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>BonusesOperationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Receipt</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expense</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/BonusesOperation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>BonusesOperation</Name>
			<BasedOn>
				<xr:Item>Catalog.DiscountCards</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Bonuses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BonusesOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BonusesQuantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Card</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Guest</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuestGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>990</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BonusOperationSources</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BonusesValidity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpiryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentDoc</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InputAccumulatingDiscountBalances</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/WriteOffExpiredBonuses/Ext/ObjectModule.bsl
#Region Public

// -----------------------------------------------------------------------------
//
// Parameters:
//  pParameter	 - 	Undefined, Structure - Parametrs for fill
//
Procedure pmLoadDataProcessorAttributes(pParameter = Undefined) Export
	cmLoadDataProcessorAttributes(ThisObject, pParameter);
EndProcedure // pmLoadDataProcessorAttributes

// -----------------------------------------------------------------------------
Procedure pmSaveDataProcessorAttributes() Export
	cmSaveDataProcessorAttributes(ThisObject);
EndProcedure // pmSaveDataProcessorAttributes

// -----------------------------------------------------------------------------
// Initialize attributes with default values
// Attention: This procedure could be called AFTER some attributes initialization
// routine, so it SHOULD NOT reset attributes being set before
// -----------------------------------------------------------------------------
Procedure pmFillAttributesWithDefaultValues() Export
	// NOTHING SO FAR
EndProcedure // pmFillAttributesWithDefaultValues

// -----------------------------------------------------------------------------
//  Run data processor in silent mode
//
// Parameters:
//  pParameter		 - Undefined - Not Use
//  pIsInteractive	 - Boolean	 - Interactive mode
//
Procedure pmRun(pParameter = Undefined, pIsInteractive = False) Export
	pmWriteOffBonuses(pIsInteractive);	
EndProcedure // pmRun

// -----------------------------------------------------------------------------
//
// Parameters:
//  pDateFrom	 - Date	 - Date from
//  pDateTo		 - Date	 - Date to
//
Procedure pmWriteOffBonuses(pIsInteractive = False) Export
	If Not ValueIsFilled(DiscountType) Then
		vMsg = Nstr("en = 'It is necessary to select the loyalty program!'; de = 'Es ist notwendig, das Treueprogramm auszuwählen!'; ru = 'Необходимо указать программу лояльности!'");
		If pIsInteractive Then
			tcCommonFunctionOnClientServer.TextMessage(vMsg, MessageStatus.Attention);
		Else
			WriteLogEvent("DataProcessors.WriteOffExpiredBonuses", EventLogLevel.Warning, , , vMsg);
		EndIf;
		Raise vMsg;
	EndIf;
	If Not ValueIsFilled(AccountingDate) Then
		vMsg = Nstr("en = 'Accounting date should be filled!'; de = 'Rechnungsdatum sollte ausgefüllt werden!'; ru = 'Учетная дата должна быть заполнена!'");
		If pIsInteractive Then
			tcCommonFunctionOnClientServer.TextMessage(vMsg, MessageStatus.Attention);
		Else
			WriteLogEvent("DataProcessors.WriteOffExpiredBonuses", EventLogLevel.Warning, , , vMsg);
		EndIf;
		Raise vMsg;
	EndIf;

	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	BonusesBalance.Card AS Card,
	|	BonusesBalance.ExpiryDate AS ExpiryDate,
	|	BonusesBalance.QuantityBalance AS QuantityBalance
	|FROM
	|	AccumulationRegister.Bonuses.Balance(
	|			&qPeriod,
	|			Card.DiscountType IN HIERARCHY (&qLoyaltyProgram)
	|				AND (&qHotelIsFilled
	|						AND Card.CreateHotel IN HIERARCHY (&qHotel)
	|					OR NOT &qHotelIsFilled)
	|				AND ExpiryDate > &qEmptyDate) AS BonusesBalance
	|
	|ORDER BY
	|	BonusesBalance.Card.Identifier";
	vQry.SetParameter("qLoyaltyProgram", DiscountType);
	vQry.SetParameter("qPeriod", New Boundary(AccountingDate, BoundaryType.Excluding));
	vQry.SetParameter("qHotel", Hotel);
	vQry.SetParameter("qHotelIsFilled", ValueIsFilled(Hotel));
	vQry.SetParameter("qEmptyDate", '00010101');
	vExpiredBonuses = vQry.Execute().Unload();
	// Create bonuses operations to write-off bonuses expired
	For Each vExpiredBonusesRow In vExpiredBonuses Do
		CreateBonusesOperationDocument(vExpiredBonusesRow);     
	EndDo;
EndProcedure // pmWriteOffBonuses

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
Procedure CreateBonusesOperationDocument(pExpiredBonusesRow)
	vDocObj = Documents.BonusesOperation.CreateDocument();
			
	vDocObj.OperationType = Enums.BonusesOperationTypes.Expense;

	vDocObj.Date = CurrentSessionDate();
	vDocObj.Author = SessionParameters.CurrentUser;
	
	vDocObj.Card = pExpiredBonusesRow.Card;
	vDocObj.ExpiryDate = pExpiredBonusesRow.ExpiryDate;

	vDocObj.BonusesQuantity = pExpiredBonusesRow.QuantityBalance;
	
	vDocObj.Hotel = pExpiredBonusesRow.Hotel;

	vDocObj.Guest = pExpiredBonusesRow.DiscountCard.Client;
	vDocObj.GuestGroup = Catalogs.GuestGroups.EmptyRef();
	vDocObj.Room = Catalogs.Rooms.EmptyRef();
	
	vDocObj.Source = Source;
	If ValueIsFilled(vDocObj.Source) Then
		vDocObj.Remarks = "";
	Else
		vDocObj.Remarks = NStr("en='Auto write-off by expiry date'; ru='Автосписание по истечению срока действия'; de='Automatische Abschreibung nach Ablaufdatum'");
	EndIf;
	
	vDocObj.Write(DocumentWriteMode.Posting);
EndProcedure //  CreateBonusesOperationDocuments

#EndRegion
